---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewerDetailNumber
source: html/2192c784-c36d-80cc-16da-545dfd8516a7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewerDetailNumber Property

"Detail Number"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewerDetailNumber { get; }
```